titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [1]:
import pandas as pd
import numpy as np

In [2]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic=pd.read_csv("train.csv")
display(df_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [3]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic.Survived==0].Age.mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [4]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic.Survived==0].Fare.mean()

22.117886885245877

In [5]:
df_titanic[df_titanic.Survived==0].Fare.median()

10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [6]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic.Survived==0) & (df_titanic.Sex=="male")].Age.mean()

31.618055555555557

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [7]:
df_titanic[(df_titanic.Survived==0) & (df_titanic.Sex=="female")].Age.mean()

25.046875

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [8]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic.Survived==1)].Age.mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [9]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic.Survived==1)].Fare.mean()

48.39540760233917

Kazadan kurtulan toplam kişi sayısını bulunuz

In [10]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
len(df_titanic[(df_titanic.Survived==1)])

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [11]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic.Survived==1) & (df_titanic.Sex=="male")].Age.mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [12]:
df_titanic[(df_titanic.Survived==1) & (df_titanic.Sex=="female")].Age.mean()

28.84771573604061

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [13]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic.Age<10].Fare.median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [14]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic.Age>10].Fare.median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [15]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
display(df_titanic)

rate_of_death = {'Class':['First Class', 'Second Class', 'Third Class'],
                 'Perc. of death':[100*len(df_titanic[(df_titanic.Pclass==1) & (df_titanic.Survived==0)])/len(df_titanic[df_titanic.Pclass==1]),
                    100*len(df_titanic[(df_titanic.Pclass==2) & (df_titanic.Survived==0)])/len(df_titanic[df_titanic.Pclass==2]),
                    100*len(df_titanic[(df_titanic.Pclass==3) & (df_titanic.Survived==0)])/len(df_titanic[df_titanic.Pclass==3])]}

df_rate_of_death=pd.DataFrame(rate_of_death)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [16]:

print("Unsurprisingly, death rate of first class passengers is lower than second class passengers.Similary, second clas passengers death rate is lower than third class passengers. Below, you can see the percentage of death rates by each class.")
display(df_rate_of_death)

Unsurprisingly, death rate of first class passengers is lower than second class passengers.Similary, second clas passengers death rate is lower than third class passengers. Below, you can see the percentage of death rates by each class.

          Class  Perc. of death
0   First Class       37.037037
1  Second Class       52.717391
2   Third Class       75.763747

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [17]:
df_titanic[df_titanic.Pclass==1].Fare.describe()

count    216.000000
mean      84.154687
std       78.380373
min        0.000000
25%       30.923950
50%       60.287500
75%       93.500000
max      512.329200
Name: Fare, dtype: float64

In [18]:
df_titanic[df_titanic.Pclass==2].Fare.describe()

count    184.000000
mean      20.662183
std       13.417399
min        0.000000
25%       13.000000
50%       14.250000
75%       26.000000
max       73.500000
Name: Fare, dtype: float64

In [19]:
df_titanic[df_titanic.Pclass==3].Fare.describe()

count    491.000000
mean      13.675550
std       11.778142
min        0.000000
25%        7.750000
50%        8.050000
75%       15.500000
max       69.550000
Name: Fare, dtype: float64

In [20]:
print("From the tables above, we can infer that third class passengers constitute more than half of the total passengers. On average, first class fares are higher than of second class, and similary, second class fares are higher than of third class. However, standart deviation of the fares of the first class passengers are significantly higher than of the other two classes. Above, you can see more information regarding the distribution of fares.")

From the tables above, we can infer that third class passengers constitute more than half of the total passengers. On average, first class fares are higher than of second class, and similary, second class fares are higher than of third class. However, standart deviation of the fares of the first class passengers are significantly higher than of the other two classes. Above, you can see more information regarding the distribution of fares.

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [21]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız. 

rate_of_death_by_gender = {'Gender':['Women', 'Men'],
                 'Perc. of death':[100*len(df_titanic[(df_titanic.Survived==0) & (df_titanic.Sex=="female")])/len(df_titanic[df_titanic.Sex=="female"]),
                    100*len(df_titanic[(df_titanic.Survived==0) & (df_titanic.Sex=="male")])/len(df_titanic[df_titanic.Sex=="male"])]}

rate_of_death_by_gender=pd.DataFrame(rate_of_death_by_gender)

In [22]:
rate_of_death_by_gender

  Gender  Perc. of death
0  Women       25.796178
1    Men       81.109185

In [23]:
print("Percentage of death rate of men are significantly higher than of women, being %81 and %25 respectively. Maybe, in Titanic “women and children first” policy might have been implemented during the rescue process.")

Percentage of death rate of men are significantly higher than of women, being %81 and %25 respectively. Maybe, in Titanic “women and children first” policy might have been implemented during the rescue process.

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [24]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız

df_titanic[(df_titanic.Sex=="male") & (df_titanic.Survived==0)].Fare.mean()

21.960992948717944

In [25]:
df_titanic[(df_titanic.Sex=="male") & (df_titanic.Survived==1)].Fare.mean()

40.82148440366974

In [26]:
print("We can see that average fare of the men survived was 40.82 whereas average fare of the men who has died was 21.96. We can say that if you pay more you are more likely to survive.")

We can see that average fare of the men survived was 40.82 whereas average fare of the men who has died was 21.96. We can say that if you pay more you are more likely to survive.

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

In [27]:
df_titanic_missing=pd.read_csv("train_missing.csv")

In [28]:
display(df_titanic_missing)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [29]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic_missing.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

In [30]:
# Age is filled with mean value
df_titanic_age_fill = df_titanic_missing.copy()
df_titanic_age_fill.Age = df_titanic_age_fill.Age.fillna(df_titanic_age_fill.Age.mean())

In [31]:
#Embarked is filled with mode value since it is categorical
df_titanic_embarked_fill = df_titanic_missing.copy()
df_titanic_embarked_fill.Embarked = df_titanic_embarked_fill.Embarked.fillna(df_titanic_embarked_fill.Embarked.mode()[0])

In [32]:
print("For Fare, i need to do a little more analysis. Because, previously, we have found that fares  significantly differ depending on the class type.")
df_titanic_missing.Fare.describe()

For Fare, i need to do a little more analysis. Because, previously, we have found that fares  significantly differ depending on the class type.

count    800.000000
mean      31.844822
std       47.825392
min        0.000000
25%        7.895800
50%       14.456250
75%       30.771850
max      512.329200
Name: Fare, dtype: float64

In [33]:
df_titanic_missing[df_titanic_missing.Fare.isnull()].Pclass.value_counts()

3    46
1    23
2    22
Name: Pclass, dtype: int64

In [34]:
print("Here we see that,NA fares of third clas passengers constitute more than half of the total passengers. So, using total mean would be wrong. Instead we will use means of each class to fill the NA values.")

Here we see that,NA fares of third clas passengers constitute more than half of the total passengers. So, using total mean would be wrong. Instead we will use means of each class to fill the NA values.

In [35]:
#Here, you can see the means of each class
df_titanic_missing.groupby(['Pclass']).Fare.mean()

Pclass
1    83.221999
2    20.837731
3    13.569212
Name: Fare, dtype: float64

In [36]:
# Fare is filled with mean value
df_titanic_fare_fill = df_titanic_missing.copy()


# Fill first class Na values with first class mean
df_titanic_fare_fill.loc[df_titanic_fare_fill["Pclass"]==1, "Fare"] = df_titanic_fare_fill.loc[df_titanic_fare_fill["Pclass"] == 1, "Fare"].fillna(value=df_titanic_fare_fill.query("Pclass==1")["Fare"].mean())

# Fill second class Na values with second class mean

df_titanic_fare_fill.loc[df_titanic_fare_fill["Pclass"]==2, "Fare"] = df_titanic_fare_fill.loc[df_titanic_fare_fill["Pclass"] == 2, "Fare"].fillna(value=df_titanic_fare_fill.query("Pclass==2")["Fare"].mean())

# Fill third class Na values with third class mean
df_titanic_fare_fill.loc[df_titanic_fare_fill["Pclass"]==3, "Fare"] = df_titanic_fare_fill.loc[df_titanic_fare_fill["Pclass"] == 3, "Fare"].fillna(value=df_titanic_fare_fill.query("Pclass==3")["Fare"].mean())

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [37]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic_missing.SibSp.describe()

count    721.000000
mean       0.535368
std        1.140996
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

In [38]:
print("We can see that at least half of the passengers have no siblings. Thus using mode value or median value will work")

We can see that at least half of the passengers have no siblings. Thus using mode value or median value will work

In [39]:
# SibSp is filled with mode value
df_titanic_SibSp_fill = df_titanic_missing.copy()
df_titanic_SibSp_fill.SibSp = df_titanic_age_fill.SibSp.fillna(df_titanic_SibSp_fill.SibSp.mode()[0])

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [40]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic_Embarked_fill = df_titanic_missing.copy()
df_titanic_Embarked_fill[['Embarked']].fillna("NAN")

    Embarked
0          S
1          C
2        NAN
3          S
4        NAN
..       ...
886        S
887        S
888        S
889      NAN
890        Q

[891 rows x 1 columns]

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [41]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic_missing_2 = df_titanic_missing.copy()

In [42]:
na_indices = df_titanic_missing_2.Fare[df_titanic_missing_2.Fare.isnull()].index.to_list()

In [43]:
na_indices

[11,
 12,
 17,
 35,
 40,
 45,
 67,
 69,
 70,
 97,
 105,
 113,
 129,
 162,
 166,
 175,
 181,
 182,
 193,
 206,
 210,
 215,
 229,
 255,
 264,
 267,
 283,
 296,
 301,
 308,
 324,
 332,
 354,
 390,
 396,
 404,
 413,
 417,
 427,
 430,
 436,
 437,
 438,
 440,
 443,
 456,
 463,
 490,
 494,
 504,
 533,
 562,
 589,
 596,
 599,
 608,
 614,
 617,
 618,
 627,
 654,
 659,
 676,
 679,
 681,
 684,
 690,
 695,
 721,
 722,
 729,
 748,
 752,
 757,
 763,
 773,
 781,
 783,
 790,
 794,
 798,
 806,
 808,
 822,
 823,
 825,
 841,
 863,
 872,
 885,
 888]

In [44]:
df_titanic_missing_2.insert(10,"Fare_Missing",0)
df_titanic_missing_2.loc[na_indices, "Fare_Missing"] = df_titanic_missing_2.Fare.median()

In [45]:
display(df_titanic_missing_2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,0.00000,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,0.00000,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,0.00000,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,0.00000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,0.00000,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,0.00000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,0.00000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,14.45625,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,0.00000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,0.00000,NaN,Q